<?php
/*
Task-1. 以下のクラスを作成する。
    1. 地域クラス
        - 属性：カッコの中はデータ型（コンストラクタおよびアクセサメソッドに表記）
            id(int)
            name(string)
        - コンストラクタの引数ですべての属性を初期化する。
        - アクセサメソッドはすべての属性に対してgetterのみを作成する。
    
    2．レストランクラス
        - 属性：カッコの中はデータ型（コンストラクタおよびアクセサメソッドに表記）
            id(int)
            name(string)
            detail(string)
            image(string)
            area(int)
        - コンストラクタの引数ですべての属性を初期化する。
        - アクセサメソッドはすべての属性に対してgetterのみを作成する。
    
    3．レビュクラス
        - 属性：カッコの中はデータ型（コンストラクタおよびアクセサメソッドに表記）
            id(int)
            restaurant(int)
            comment(string)
            reviewer(string)
            rating(int)
        - コンストラクタの引数ですべての属性を初期化する。
        - アクセサメソッドはすべての属性に対してgetterのみを作成する。

Task-2．areasテーブルの全レコードを取得する。
        - 取得するレコードは地域クラスのインスタンスとし、そのインスタンスを要素とする配列を作成する。

Task-3．作成した配列を、表として表示する。

Task-4．作成した配列からセレクトボックスを表示する。

 */ 

?>